<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>08_位运算与二进制</title>
</head>
<body>
    <!-- 二进制：
    0000 0000
    计算公式：0011 1001 -> 0 1 2 3 4 5 6 7 
    1+0+0+2^3+2^4+2^5=9+16+32=57



    位运算符：
    1.允许对整型数中制定的位进行求值和操作
    例子
    $a & $b     按位与      将把 $a和 $b中都为1的位设为1
    $a | $b     按位或      将把 $a和 $b中任何为1的位设为1
    $a ^ $b     按位异或    将把 $a和 $b中一个为1另一个为0的位设为1
    ~ $a        按位取反    将 $a 中为 0 的位设为 1，反之亦然
    $a << $b    左移        将 $a 中的位向左移动 $b次（乘2）
    $a >> $b    右移        将 $a 中的位向右移动 $b次（除2）
    -->


    <?php
    // 6 0000 0110
    // 9 0000 1001
    // 0 0000 0000

    $r1 = 9 & 6;
    echo $r1;
    echo "----------------!";
    // 6  0000 0110
    // 9  0000 1001
    // 15 0000 1111
    $r2 = 9 | 6;
    echo $r2;
    echo "----------------!";
    // 3 0000 0011
    // 1 0000 0001
    // 2 0000 0010

    $r3 = 3 ^ 1;
    echo $r3;
    echo "----------------!";
    //   3 0000 0011
    //     1111 1100 反码
    // -3  1111 1101 补码 
    // -4  没有+1，所以是-4
    $r4 = ~3;
    echo $r4;

    echo "----------------!";
    //   3 0000 0011
    $r5 = 3<<1;
    echo $r5;
    $r6 = 3>>1;
    echo $r6;
    ?>
</body>
</html>